# Task 1

1. Create a dataframe (3 rows x 4 columns) in Pandas, where column names are
"Eleanor", "Chedi", "Tahani", "Jason".

1. Populate all 12 cells with random integers from 0 to 100 (inclusive)

1. Output:
    - Print entire dataframe
    - Print only first value from Eleanor column


1. Modification
    - Add new column called "Janet" that sumns values of "Tahani" and "Jason" in that row.
    - Print

In [2]:
# Importing libraries
import numpy as np
import pandas as pd

### Task 1
1. Create a dataframe (3 rows x 4 columns) in Pandas, where column names are
"Eleanor", "Chedi", "Tahani", "Jason".

1. Populate all 12 cells with random integers from 0 to 100 (inclusive)

1. Output:
    - Print entire dataframe

In [6]:
# Creating a random data:
    # Shape is 3 rows and 4 columns
    # Values are integers from 0 to 100 (inclusive)

my_data = np.random.randint(101, size=(3,4))
my_data

# For data, 4 column names are as given
column_names = ["Eleanor", "Chedi", "Tahani", "Jason"]
my_dataframe = pd.DataFrame(my_data, columns=column_names)
my_dataframe

   Eleanor  Chedi  Tahani  Jason
0       64     55      21     36
1       83     33      13     84
2       38     31      81     35

#### Task 1
3. Output
    - Print only first value from Eleanor column

In [7]:
# Locating 1st data from Eleanor column.
my_dataframe["Eleanor"].iloc[[0]]

0    64
Name: Eleanor, dtype: int64


### Task 1
4. Modification
    - Add new column called "Janet" that sumns values of "Tahani" and "Jason" in that row.

In [8]:
# Adding new column named Janet, which sums the value from Tahani and Jason in that row.
my_dataframe["Janet"] = my_dataframe["Tahani"] + my_dataframe["Jason"]

#### Task 1
4. Modification
    - Print

In [9]:
# Printing the modified Dataframe
my_dataframe

   Eleanor  Chedi  Tahani  Jason  Janet
0       64     55      21     36     57
1       83     33      13     84     97
2       38     31      81     35    116